-- 常量
BaseConstant = {
  BODY_EFFECT = {
    SMOG1 = 1226, -- 一团小烟雾随即消失

    BOOM1 = 1186, -- 黄色的小爆炸脚下一个圈

    LIGHT1 = 1005, -- 传送黄呼啦圈
    LIGHT3 = 1008, -- 一颗心加血特效
    LIGHT4 = 1023, -- 三格大小四散旋转的黄光
    LIGHT9 = 1150, -- 一堆心加血特效
    LIGHT10 = 1185, -- 两格大小的两个气旋不停旋转
    LIGHT19 = 1223, -- 一格大小的淡蓝色方框气流圈住流动
    LIGHT22 = 1227, -- 一圈紫色光幕围住并盘旋着锁链
    LIGHT24 = 1231, -- 黄色的无敌盾保护圈
    LIGHT26 = 1235, -- 红十字加血特效
    LIGHT30 = 1249, -- 传送旋涡慢慢消失关闭
    LIGHT47 = 1337, -- 接近一格大小的一团蓝色光雾周围一些小蓝点
    LIGHT62 = 1495, -- 一个三格大小的蓝色护罩
    LIGHT63 = 1497, -- 一个三格大小的红色护罩
    LIGHT64 = 1498, -- 一个三格大小的白色护罩

    PARTICLE18 = 1237, -- 泡泡包裹效果
    PARTICLE24 = 1341 -- 两格大小的一个黄色小光源
  },
  SOUND_EFFECT = {
    ACTION4 = 10007, -- 放置/破坏方块的声音
    ACTION5 = 10010, -- 放置/破坏方块的声音
    SKILL9 = 10086, -- 一阵风的声音
    PROMPT19 = 10963 -- 长音
  }
}
