-- 常量
BaseConstant = {
  UNKNOWN_BLOCK = 4095, -- 未知方块
  ACTORBODY_EFFECT = {
    A0 = 0, -- 受伤（小）
    A1 = 1, -- 烟雾（小）（循环）
    A2 = 2, -- 旋转消失光圈（大）
    A3 = 3, -- 大型光效，类似发大招（超大）
    A4 = 4, -- 短暂的一团火焰（大）
    A5 = 5, -- 向四周排气的效果（大）
    A6 = 6, -- 生成一些星星并消失（小）
    A7 = 7, -- 脚底吹一口气（小）
    A8 = 8, -- 绿叶飞舞效果（小）
    A9 = 9, -- 禁止符号（小）
    A10 = 10, -- 需要竹子符号（小）
    A11 = 11, -- 一个鬼头（小）
    A12 = 12, -- 生成一些金币（小）
    A13 = 13, -- ？？？
    A14 = 14, -- 一个短暂的白色护罩（小）
    A15 = 15, -- 类似一个浅紫色放毒技能效果（大）（卡）
    A16 = 16, -- 类似一个红色放毒技能效果（大）（卡）
    A17 = 17, -- 类似一个紫色放毒技能效果（大）（卡）
    A18 = 18, -- 小竖线光（小）（循环）
    A19 = 19, -- 重击地面的效果（较小）
    A20 = 20, -- 着火冒烟（较小）（循环）
    A21 = 21, -- 一会儿出现一个类似日文（小）（循环）
    A22 = 22, -- 一会儿出现一个类似日文（较小）（循环）
    A23 = 23, -- 头顶金币加红心（小）
    A24 = 24, -- 投掷物命中造成伤害效果加声音
    A25 = 25, -- 投掷物命中无伤害效果加声音
    A26 = 26, -- 25效果无声音
    A27 = 27, -- 需要牛奶符号（小）
    A28 = 28, -- 生气符号（小）
    A29 = 29, -- 睡觉（小）（循环）
    A30 = 30, -- 短暂的蓝色魔法光（小）
    A31 = 31, -- 禁止符号（小）
    A32 = 32, -- 绿光点，表现为动物眼睛发绿光
    A33 = 33, -- 屁股着火（小）（循环）
    A34 = 34, -- 眩晕（小）（循环）
    A35 = 35, -- 电灯泡（小）（循环）
    A36 = 36, -- ？？？
    A37 = 37, -- 脚底下好像有什么
    A38 = 38, -- 脚下两个旋，一个白色小，一个蓝色大（较小）（循环）
    A39 = 39, -- 黄光扩散，类似一个小群体技能（较小）
    A40 = 40, -- ？？？
    A41 = 41, -- 前方一个淡蓝色圆弧屏障（较小）（循环）
    A42 = 42, -- 一个类似拍浪效果（小）
    A43 = 43, -- 与38效果相同
    A44 = 44, -- 汇集一圈然后一个拍浪效果（小）
  },
  BODY_EFFECT = {
    SMOG1 = 1226, -- 一团小烟雾随即消失

    BOOM1 = 1186, -- 黄色的小爆炸脚下一个圈

    LIGHT1 = 1005, -- 传送黄呼啦圈
    LIGHT3 = 1008, -- 一颗心加血特效
    LIGHT4 = 1023, -- 三格大小四散旋转的黄光
    LIGHT9 = 1150, -- 一堆心加血特效
    LIGHT10 = 1185, -- 两格大小的两个气旋不停旋转（循环）
    LIGHT19 = 1223, -- 一格大小的淡蓝色方框气流圈住流动（循环）
    LIGHT22 = 1227, -- 一圈紫色光幕围住并盘旋着锁链（循环）
    LIGHT24 = 1231, -- 黄色的无敌盾保护圈（循环）
    LIGHT26 = 1235, -- 红十字加血特效
    LIGHT30 = 1249, -- 传送旋涡慢慢消失关闭
    LIGHT31 = 1253, -- 一根光绳从下往上围着目标转一圈
    LIGHT34 = 1291, -- 粒子向圆光圈中聚集然后全部消失
    LIGHT36 = 1297, -- 轰击地面的蓝色光束（循环）
    LIGHT37 = 1298, -- 轰击地面的红色光束（循环）
    LIGHT38 = 1299, -- 轰击地面的白色光束（循环）
    LIGHT40 = 1301, -- 循环播放的一个小雷球（循环）
    LIGHT47 = 1337, -- 接近一格大小的一团蓝色光雾周围一些小蓝点（循环）
    LIGHT62 = 1495, -- 一个三格大小的蓝色护罩（循环）
    LIGHT63 = 1497, -- 一个三格大小的红色护罩（循环）
    LIGHT64 = 1498, -- 一个三格大小的白色护罩（循环）

    PARTICLE18 = 1237, -- 泡泡包裹效果（循环）
    PARTICLE24 = 1341, -- 两格大小的一个黄色小光源（循环）

    PROMPT9 = 1187, -- 四个大小的白色圆圈（循环）
    PROMPT10 = 1188, -- 四个大小的红色圆圈（循环）
    PROMPT11 = 1189, -- 四个大小的蓝色圆圈（循环）
    PROMPT12 = 1190, -- 四个大小的绿色圆圈（循环）
    PROMPT13 = 1191, -- 四个大小的黄色圆圈（循环）
    PROMPT14 = 1192, -- 四格大小的橙色圆圈（循环）
    PROMPT15 = 1193, -- 四格大小的紫色圆圈（循环）
    PROMPT17 = 1267, -- 一格大小的向下红箭头（循环）
  },
  SOUND_EFFECT = {
    ACTION4 = 10007, -- 放置/破坏方块的声音
    ACTION5 = 10010, -- 放置/破坏方块的声音
    SKILL9 = 10086, -- 一阵风的声音
    MUSIC58 = 10783, -- 敲鼓的声音
    PROMPT7 = 10951, -- 死亡的声音
    PROMPT19 = 10963, -- 长音
  }
}
